SteveMicroCode/PIC-12F1840-Demo-Code/PIC12F1840ADC.c

// ---------------------------------------------------------------------
// The PIC12F1840/TM1637 display code was adapted by Steve Williams
// for Microchip's MPLAB XC8 compiler. The TM1637 routines were originally
// written by electro-dan for the BoostC compiler as part of project: 
// https://github.com/electro-dan/PIC12F_TM1637_Thermometer. That project used
// a PIC12F675 and I have ported the original code for the PIC12F1840 here. 
// 
// This code demonstrates use of the PICF1840 analogue to digital convertor (ADC)
// with display of results on the TM1637 display. It can read one of the 4 
// available analogue inputs AN0..3. Enable a pin as analogue input by setting it's
// bit eg.for 2 ports: ADCinputConfig = 0b00000011. The voltage reference used is configurable
// and this code uses the hardware fixed voltage reference (FVR). The FVR offers 3 voltages
// according to the span required, set uint8_t ADCrefSelect to configure. Pre-configured ADC
// channels may be selected on the fly in code, uint8_t ADCchannel controls.
//
// No warranty is implied and the code is for test use at users own risk. 
// 
// Hardware configuration for the PIC 12F1840:
// RA0 = AN0 analogue input 0
// RA1 = AN1 analogue input 1
// RA2 = OUT: LED via 560R resistor
// RA3 = OUT: N/C
// RA4 = IN/OUT: TM1637 DIO
// RA5 = IN/OUT: TM1637 CLK
// -----------------------------------------------------------------------


#include <xc.h>

// PIC12F1840 Configuration Bit Settings:

// CONFIG1
#pragma config FOSC = INTOSC    // Oscillator Selection (INTOSC oscillator: I/O function on CLKIN pin)
#pragma config WDTE = OFF       // Watchdog Timer Enable (WDT disabled)
#pragma config PWRTE = OFF      // Power-up Timer Enable (PWRT disabled)
#pragma config MCLRE = ON       // MCLR Pin Function Select (MCLR/VPP pin function is MCLR)
#pragma config CP = OFF         // Flash Program Memory Code Protection (Program memory code protection is disabled)
#pragma config CPD = OFF        // Data Memory Code Protection (Data memory code protection is disabled)
#pragma config BOREN = ON       // Brown-out Reset Enable (Brown-out Reset enabled)
#pragma config CLKOUTEN = OFF   // Clock Out Enable (CLKOUT function is disabled. I/O or oscillator function on the CLKOUT pin)
#pragma config IESO = OFF       // Internal/External Switchover (Internal/External Switchover mode is disabled)
#pragma config FCMEN = OFF      // Fail-Safe Clock Monitor Enable (Fail-Safe Clock Monitor is disabled)
// CONFIG2
#pragma config WRT = OFF        // Flash Memory Self-Write Protection (Write protection off)
#pragma config PLLEN = ON       // PLL Enable (4x PLL enabled)
#pragma config STVREN = ON      // Stack Overflow/Underflow Reset Enable (Stack Overflow or Underflow will cause a Reset)
#pragma config BORV = LO        // Brown-out Reset Voltage Selection (Brown-out Reset Voltage (Vbor), low trip point selected.)
#pragma config DEBUG = OFF      // In-Circuit Debugger Mode (In-Circuit Debugger disabled, ICSPCLK and ICSPDAT are general purpose I/O pins)
#pragma config LVP = OFF        // Low-Voltage Programming Enable (High-voltage on MCLR/VPP must be used for programming)

// Single line config setup can be used: #pragma config FOSC=INTOSC,etc,....

#define _XTAL_FREQ 32000000      // Define clock frequency used by xc8 __delay(time) functions


// Set the TM1637 module data and clock pins:
#define trisConfiguration 0b00110000; // TM1637 GP4/5 pins are inputs, TM1637 module pullups 
                                      // will take these high. Configuration here of display pins ONLY 
#define tm1637dio RA4                 // Set the i/o ports names for TM1637 data and clock here
#define tm1637dioTrisBit 4            // This is the bit shift to set TRIS for GP4
#define tm1637clk RA5
#define tm1637clkTrisBit 5

//Timer1 definitions:
#define T1PRESCALE 0x03                // 2 bits control, 01 = 1:2 used for 8 MHz clk, 11 = 1:8 for 32 MHz
#define TIMER1ON 0x01                  // Used to set bit0 T1CON = Timer1 ON
// Timer1 setup values for 50ms interrupt using a preload:
#define TIMER1LOWBYTE 0x60             // 50000 cycles @ 1:8 prescale == 50ms.
#define TIMER1HIGHBYTE 0x3C            // Preload no delays = 65536-50000 = 15536 = 0x3C60

//General global variables:
volatile uint8_t timer1Flag = 0;               // Flag is set by Timer 1 ISR every 50ms
uint8_t ADCreadcounter = 0;                    // Counts intervals for ADC task in 50ms increments
uint8_t ADCreadStatus = 0;                     // Stage of ADC conversion task, 0 = not started
uint8_t LEDcounter = 0;                        // Used to time non-blocking LED flash in 50ms increments
uint8_t LEDonTime = 0;                         // If true LED flash routine is called, flashes N x 50ms 

//ADC definitions:
#define NOCONVERSION 0
#define STARTADCREAD 1
#define CONVERTING 2    

//ADC variables:
const uint8_t ADCinputConfig = 0b00000011; // Bit 0..4 set enables analogue input in PORTA, 
                                           // and is used to set both TRISA and ANSELA, here AN0..1 enabled


//Display variables:
const uint8_t tm1637ByteSetData = 0x40;        // 0x40 [01000000] = Indicate command to display data
const uint8_t tm1637ByteSetAddr = 0xC0;        // 0xC0 [11000000] = Start address write out all display bytes 
const uint8_t tm1637ByteSetOn = 0x88;          // 0x88 [10001000] = Display ON, plus brightness
const uint8_t tm1637ByteSetOff = 0x80;         // 0x80 [10000000] = Display OFF 
const uint8_t tm1637MaxDigits = 4;
const uint8_t tm1637RightDigit = tm1637MaxDigits - 1;
// Used to output the segment data for numbers 0..9 :
const uint8_t tm1637DisplayNumtoSeg[] = {0x3f, 0x06, 0x5b, 0x4f, 0x66, 0x6d, 0x7d, 0x07, 0x7f, 0x6f};
uint8_t tm1637Brightness = 5;         // Range 0 to 7
uint8_t tm1637Data[] = {0, 0, 0, 0};  //Digit numeric data to display,array elements are for digits 0..3
uint8_t decimalPointPos = 99;         //Flag for decimal point (digits counted from left),if > MaxDigits dp off// Digit flag for decimal point (digits counted from left),if > MaxDigits dp off
uint8_t zeroBlanking = 0;             // If set true blanks leading zeros
uint8_t numDisplayedDigits = 3;       // Limits total displayed digits, used after rounding a decimal value

// ISR Handles Timer1 interrupt:
void __interrupt() ISR(void);  // Note XC8 interrupt function setup syntax using __interrupt() + myisr()
void initialise12F1840(void);
void initialise12F1840ADC(uint8_t ADCrefSelect,uint8_t ADCchannel);      //Initialises the ADC
void setADCchannel(uint8_t ADCchannel);        // Sets the ADC channel in use, 0..3 are valid values
void LEDflash(void);
uint16_t readADC(uint8_t ADCrefSelect);        // Returns ADC Vin in mV, ie 5000 max if Vref if Vref = 5V
void tm1637StartCondition(void);
void tm1637StopCondition(void);
uint8_t tm1637ByteWrite(uint8_t bWrite);
void tm1637UpdateDisplay(void);
void tm1637DisplayOn(void);
void tm1637DisplayOff(void);
uint8_t getDigits(uint16_t number);   //Extracts decimal digits from integer, populates tm1637Data array
void roundDigits(void);


void main(void)
{
  uint8_t ADCchannel = 0;        // Active ADC channel, AN0 = 0..AN3 = 3, nb only 0 and 1 set up in this code
  const uint8_t ADCrefSelect = 0x03;  // Used to set FVR ADC ref volts ADFVR bits 1..0,nb ADC read/mV calc also uses
                                      // Valid values are 01=0x01: 1.024V, 10=0x02: 2.048V, 11=0x03: 4.096V
  uint16_t displayedInt=0;       // Beware 65K limit if larger than 4 digit display,consider using uint32_t
  uint16_t ctr = 0;
  
  _delay(100);
  initialise12F1840();
  initialise12F1840ADC(ADCrefSelect, ADCchannel);
  zeroBlanking = 0;              // Don't blank leading zeros
  decimalPointPos = 0;           // Display 0-5000mV as n.nnn volts, digit 0 = leftmost
  getDigits(displayedInt);
  tm1637UpdateDisplay();         // Display zero then start timed conversions, updating display as completed
  ADCreadcounter = 0;            // Start with timing counts at zero, both ADC read and timer1 flags
  timer1Flag = 0; 
  T1CON |= TIMER1ON;
  while(1)
    {
      if (timer1Flag)
        {
           ADCreadcounter ++;                    // Update task interval and LED timing flags
           LEDcounter ++;                           
           timer1Flag = 0;                       // Clear the 50ms timing flag
        }
      
