SteveMicroCode/PIC-12F1840-Demo-Code/PIC12F1840ADC.c
      if (ADCreadcounter >= 20)                  // Start ADC read process every 50ms x 20 = 1 sec
        { 
           ADCreadcounter = 0;
           ADCreadStatus = STARTADCREAD;         // Setting to 1 = start of ADC read 
           LEDcounter = 0;                // Zero the LED time counter, note counts 50ms increments
           LEDonTime = 1;                 // Sets up a 500ms LED flash
        }
      
      switch (ADCreadStatus)             // The ADC read/display task is managed by ADCreadStatus control flag
      {
              case NOCONVERSION:
                  break;
                  
              case STARTADCREAD:                 // nb. must only start ADC conversions after Taq since last
                  setADCchannel(ADCchannel);     // Channels 0..3 available if configured during initialisation
                  ADCON0 |= 0x02;                        // Set GO/DONE, bit 1, to start conversion
                  ADCreadStatus = CONVERTING;
                  break;
                  
              case CONVERTING:                   // Polls GO/DONE for completed conversion,COULD ADD TIMEOUT?
                  if (!(ADCON0 & 0x02))
                  {   // Get the raw ratiometric ADC data converted to Vin in mV:
                      displayedInt = readADC(ADCrefSelect);       // Returns value as uint16_t
                      getDigits(displayedInt);   // Extract digit data from integer into 4x uint8_t array 
                      roundDigits();             // Apply rounding to the array data if <4 digits displayed
                      tm1637UpdateDisplay();
                      ADCreadStatus = NOCONVERSION;  // Consider adding a timed delay before reset this flag
                  }
                  break;
      }
             
      if (LEDonTime)                              // Call the LED flash function if a count is set
          LEDflash();   
    }                       //while(1)
}                           //main



//***************************************************************************************
// Interrupt service routine:
//***************************************************************************************

void ISR(void)
{
    if (PIR1 & 0x01)                  // Check Timer1 interrupt flag bit 0 is set
    {
        PIR1 &= 0xFE;                 // Clear interrupt flag bit 0
                                      // Reset Timer1 preload for 50ms overflow/interrupt(nb running timer)
        TMR1H = TIMER1HIGHBYTE;       // Note some timing inaccuracy due to interrupt latency + reload time
        TMR1L = TIMER1LOWBYTE;        // Correction was therefore applied to low byte to improve accuracy 
        timer1Flag = 1;               
        
    }
}

//*******************************************************************************************
//Functions: 
//*******************************************************************************************

void LEDflash(void)
{
    if (LEDcounter <= LEDonTime)
    {
        RA2 = 1;                      // LED on
    }
    else
    {
        RA2 = 0;                      // LED off
        LEDonTime = 0;                // Stop the flash
    }
}

//********************************************************************************************
// readADC() reads the 10 bit ratiometric ADCvalue (Vin/Vref). Integer arithmetic is then used 
// for conversion to a 16 bit unsigned integer value which is Vin in mV.
// This method suitable for 10 bit ADC conversions only. Conversion is very simple using FVR as Vref.
// The 12F1840 internal voltage ref (FVR)provides 3 choices of Vref, note powers of 2, simplifies integer maths
// Valid values for ADCrefSelect are 0x01,02,03.  Calculation:  ADCmV = VrefmV*ADCval/1024
// To divide by 1024 bitshift R x10, if Vref=1024 mV first a 10 bit left bitshift, hence net zero shift
// For Vref 4096mV left <<12, then R bitshift >>10, net bitshift <<2
// For Vcc 5V as ref use: uint32_t ADCmV = (uint32_t)5000 * (uint32_t)ADCval;  Note this multiply increases
// memory usage and requires use of uint32_t to store result of multiplication
// Follow this with ADCmV >>= 10;   to divide by 1024, result is the whole mV part of conversion, some data loss
//********************************************************************************************

uint16_t readADC(uint8_t ADCrefSelect)  // Returns a 16 bit unsigned integer, Vin in mV
{                                       // Very simple integer maths if use FVR as Vref, ie. 2^10mV .. 2^12mV
    ADCrefSelect --;                    // Valid values 0x 01,02,03, if we decrement this calculates a net bitshift
    uint16_t ADCval = ADRESL;           // ADC result is a 10 bit number, read lower 8 bits
    ADCval |= (uint16_t)ADRESH << 8;    // Get bits 8/9 of the result,storing as as 16 bit integer
    uint16_t ADCmV = ADCval << ADCrefSelect; // Apply the net bitshift 0->2 for mV conversion, zero for 1024mV             
    return(ADCmV);                      // Result OK as 16 bit integer as value in mV is less than 2^16(65536)  
}


/*********************************************************************************************
 tm1637UpdateDisplay()
 Publish the tm1637Data array to the display
*********************************************************************************************/
void tm1637UpdateDisplay()
{   
    uint8_t tm1637DigitSegs = 0;
    uint8_t ctr;
    uint8_t stopBlanking = !zeroBlanking;            // Allow blanking of leading zeros if flag set
            
    // Write 0x40 [01000000] to indicate command to display data - [Write data to display register]:
    tm1637StartCondition();
    tm1637ByteWrite(tm1637ByteSetData);
    tm1637StopCondition();

    // Specify the display address 0xC0 [11000000] then write out all 4 bytes:
    tm1637StartCondition();
    tm1637ByteWrite(tm1637ByteSetAddr);
    for (ctr = 0; ctr < tm1637MaxDigits; ctr ++)
    {
        tm1637DigitSegs = tm1637DisplayNumtoSeg[tm1637Data[ctr]];
        if (!stopBlanking && (tm1637Data[ctr]==0))  // Blank leading zeros if stop blanking flag not set
            {
               if (ctr < tm1637RightDigit)          // Never blank the rightmost digit
                  tm1637DigitSegs = 0;              // Segments set 0x00 gives blanked display numeral
            }
        else
        {
           stopBlanking = 1;                    // Stop blanking if have reached a non-zero digit
           if (ctr==decimalPointPos)            // Flag for presence of decimal point, digits 0..3
           {                                    // No dp display if decimalPointPos is set > Maxdigits
               tm1637DigitSegs |= 0b10000000;   // High bit of segment data is decimal point, set to display
           }
        }
        if (ctr>(numDisplayedDigits-1))
            tm1637DigitSegs = 0;             // Segments set 0x00 blanks,limits displayed digits left to right
        
        tm1637ByteWrite(tm1637DigitSegs);       // Finally write out the segment data for each digit
    }
    tm1637StopCondition();

